In [1]:
import os
import sys

module_path = os.path.abspath(os.path.join('..'))
if module_path not in sys.path:
    sys.path.append(module_path)
    
from modules import water_monitoring

In [3]:
instance = water_monitoring.WaterMonitoringInstance()
instance.read_data("../data/Benalua Consumption/Benalua 2013.csv", ";")

# instance.transform_data("alicante") Benalua Consumption/Benalua 2013.csv

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3254: DtypeWarning:

Columns (2,3) have mixed types.Specify dtype option on import or set low_memory=False.

In [4]:
instance.get_data_frame()

,CA009-52,Unnamed: 1,CT005-52,Unnamed: 3,Unnamed: 4
0,02/01/2013 3:25:36,"25,98",31/12/2012 15:30:00,2460562,NaN
1,13/03/2013 10:32:12,"78,76678",31/12/2012 16:00:00,"2460594,75",NaN
2,13/03/2013 10:32:41,"78,8452",31/12/2012 16:30:00,"2460623,5",NaN
3,13/03/2013 10:33:12,"77,53304",31/12/2012 17:00:00,"2460649,5",NaN
4,13/03/2013 10:33:41,"74,85148",31/12/2012 17:30:00,"2460675,5",NaN
...,...,...,...,...,...
793752,31/12/2013 15:11:55,"74,00881",NaN,NaN,NaN
793753,31/12/2013 15:12:27,"76,03143",NaN,NaN,NaN
793754,31/12/2013 15:12:57,"81,09696",NaN,NaN,NaN
793755,31/12/2013 15:13:28,"76,06879",NaN,NaN,NaN
793756,NaN,NaN,NaN,NaN,NaN